In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#finding, dropping missing data in a series
data = Series(['one','two',np.nan, 'four'])

In [3]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [4]:
data.isnotnull()

AttributeError: 'Series' object has no attribute 'isnotnull'

In [5]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [8]:
#finding, dropping missing data in a dataframe
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],
                    [np.nan,np.nan,np.nan]])

In [19]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [26]:
#drop rows with any(at least one) missing data
dframe.dropna(axis =0,how = 'any',thresh = None,inplace =False)

     0    1    2
0  1.0  2.0  3.0

In [21]:
dframe #inplace = False, not change the dframe in place

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [27]:
dframe.dropna()

     0    1    2
0  1.0  2.0  3.0

In [28]:
dframe.dropna(how ='all') #drop rows only if all it has is nans

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [33]:
dframe.dropna(axis =1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [34]:
#Filling missing data
dframe.fillna(1) #fill with 1

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0

In [36]:
dframe.fillna({0:5,1:6,2:7,3:8})
#fill column 0 with 5, 1 with 6, 7 with column 2, etc.

     0    1    2
0  1.0  2.0  3.0
1  5.0  5.0  6.0
2  7.0  6.0  9.0
3  5.0  6.0  7.0

In [37]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN